/*目录
基本概念 1~27
for循环 29~37
运算，二进制运算 39~56
if，Switch 58~80
while，do-while 82~89
引用 91~92
*/
//#include<>  引入模块
//数据类型*******************************************
//char 浮点数
//double 字符
//unsigned 修饰符
//string 字符串
//int a//定义了整数a
//int b = 1//定义了整数b=1
//a = 1//在建立变量后进项赋值
//const int A = 1//定义了常量A
//string abaaba = "hitsz"
//bool yes = true
//double pi =3.14159 
//cout <<  输出内容***********************************
//endl  表示输出后换行
//cin >>  控制台输入
//cin >> B;
//cout << "输入的B为:" << B << endl;
//return 0;

//for循环*********************************************
//int a, b;                           
//cin >> a >> b;                      
//for(int i = 0; i < 10;i++){         for(初始化;条件;更新方法)        
//    int x = a; 
//    a = b;                          循环体
//    b = x;
//}
//return 0;

//数学运算********************************************
//加 +   减 -   乘 *   除 /   求余 %   
//注意，整除需要除号左右都是整数，否则会有小数

//且、或、非*******************************************
//且 &&
//或 ||
//非 ！    若正确，则输出错误
//bool is = 1//(默认为真)
//bool Is = !1//(为假)

//二进制运算(输入10进制即可)****************************
//且  1&1=1
//或  1|1=1  1|0=1（a|b=max(a,b))
//位异 同位相同为1，不同为0  1^1=1  1^0=0
//取反 a=10010   ~a=01101
//左移 a=10010   a<<2(左移两位)    a=1001000
//右移 a=10010   a>>2(右移两位)    a=100(舍弃多余的)

//if语句***********************************************
//if (条件)
//{
//  语句
//}
//else
//{
//  语句
//}


//switch语句*******************************************
//switch()
//{
//case 一个符合数据类型的数字:
//    语句
//    break;
//case 一个符合数据类型的数字:
//    语句
//    break;
//default:
//    语句
//}

//while循环*********************************************
//while(条件表达式){
//    循环体语句；
//}
//do-while
//do{
//    循环体语句;
//}(条件表达式);

//引用
//数据类型 数据1 = 数据2(共用内存)

//数组
//初始化: 数据类型 数组名[数据数量];   初始默认值为0
//通过下标访问: 数组名[数据下标];   遍历可用循环
//通过下标赋值: 数组名[数据下标] = 值;